betaflight/betaflight/src/platform/common/stm32/can_hw.c
    regs->CCCR |= FDCAN_CCCR_CCE;
    return true;
}

// Leaving INIT is also asynchronous: the peripheral waits for 11 consecutive
// recessive bits on the bus before it accepts normal operation. Poll CCCR
// until the bit clears so callers do not attempt TX/RX while the controller
// is still held in init. Returns false on timeout so the caller can decide
// whether to mark the device initialised or bail.
static bool canExitConfigMode(FDCAN_GlobalTypeDef *regs)
{
    regs->CCCR &= ~FDCAN_CCCR_INIT;

    uint32_t timeout = CAN_INIT_SPIN_MAX;
    while ((regs->CCCR & FDCAN_CCCR_INIT) && timeout--) {
        // spin
    }

    return (regs->CCCR & FDCAN_CCCR_INIT) == 0U;
}

// Clear out the per-instance message RAM region. A cold peripheral contains
// indeterminate SRAM contents; sending garbage would be reported as spurious
// messages on start-up.
static void canClearMessageRam(canDevice_e device)
{
    uint32_t base = canMessageRamBase(device);

#if defined(STM32G4) || defined(STM32C5)
    uint32_t bytes = CAN_SRAM_PER_INSTANCE;
#elif defined(STM32H7)
    uint32_t bytes = CAN_H7_PER_INSTANCE_WORDS * 4U;
#else
    uint32_t bytes = 0;
#endif

    for (uint32_t addr = base; addr < base + bytes; addr += 4) {
        *(volatile uint32_t *)addr = 0;
    }
}

static void canEnableInterrupt(canDevice_e device, uint8_t irq)
{
    UNUSED(device);
#if defined(USE_HAL_DRIVER)
    HAL_NVIC_SetPriority(irq, NVIC_PRIORITY_BASE(NVIC_PRIO_CAN),
                         NVIC_PRIORITY_SUB(NVIC_PRIO_CAN));
    HAL_NVIC_EnableIRQ(irq);
#else
    NVIC_SetPriority(irq, NVIC_PRIO_CAN);
    NVIC_EnableIRQ(irq);
#endif
}

#if defined(STM32H7)
// Program the H7 Message RAM layout for this instance. Addresses in the
// SIDFC/XIDFC/RXF0C/TXBC registers are word offsets from SRAMCAN_BASE, not
// absolute byte addresses. We only activate Rx FIFO 0 and the Tx FIFO; the
// other regions (standard/extended filters, Rx FIFO 1, Rx buffers, Tx event
// FIFO) are left zero-sized.
static void canConfigureMessageRamH7(canDevice_e device, FDCAN_GlobalTypeDef *regs)
{
    const uint32_t instanceWords = (uint32_t)device * CAN_H7_PER_INSTANCE_WORDS;

    const uint32_t rf0SA = instanceWords + CAN_H7_RF0_WORD_OFFSET;
    const uint32_t tfqSA = instanceWords + CAN_H7_TFQ_WORD_OFFSET;

    // No standard / extended filter lists installed — point at the region
    // start with size 0 so the peripheral never walks them.
    regs->SIDFC = (instanceWords << FDCAN_SIDFC_FLSSA_Pos) & FDCAN_SIDFC_FLSSA_Msk;
    regs->XIDFC = (instanceWords << FDCAN_XIDFC_FLESA_Pos) & FDCAN_XIDFC_FLESA_Msk;

    // Rx FIFO 0: 3 classic-CAN elements.
    regs->RXF0C = ((rf0SA << FDCAN_RXF0C_F0SA_Pos) & FDCAN_RXF0C_F0SA_Msk)
                | ((CAN_H7_RF0_NBR << FDCAN_RXF0C_F0S_Pos) & FDCAN_RXF0C_F0S_Msk);
    regs->RXF1C = 0;
    regs->RXBC  = 0;

    // All Rx paths use 8-byte data elements (smallest, matches classic CAN).
    regs->RXESC = (CAN_H7_ESC_CODE_8B << FDCAN_RXESC_F0DS_Pos)
                | (CAN_H7_ESC_CODE_8B << FDCAN_RXESC_F1DS_Pos)
                | (CAN_H7_ESC_CODE_8B << FDCAN_RXESC_RBDS_Pos);

    // Tx buffers: 3 FIFO-mode slots, 0 dedicated buffers. TFQM = 0 (FIFO mode).
    regs->TXBC = ((tfqSA << FDCAN_TXBC_TBSA_Pos) & FDCAN_TXBC_TBSA_Msk)
               | ((CAN_H7_TFQ_NBR << FDCAN_TXBC_TFQS_Pos) & FDCAN_TXBC_TFQS_Msk);
    regs->TXEFC = 0;
    regs->TXESC = (CAN_H7_ESC_CODE_8B << FDCAN_TXESC_TBDS_Pos);
}
#endif // STM32H7

//-----------------------------------------------------------------------------
// Init / public API
//-----------------------------------------------------------------------------

void canInitDevice(canDevice_e device, uint32_t bitrate)
{
    if (device < 0 || device >= CANDEV_COUNT) {
        return;
    }

    canDevice_t *pDev = &canDevice[device];

    if (!pDev->reg || !pDev->tx || !pDev->rx) {
        return;
    }

    FDCAN_GlobalTypeDef *regs = (FDCAN_GlobalTypeDef *)pDev->reg;

    // Kernel clock first; register writes before this have undefined effect.
    RCC_ClockCmd(pDev->rcc, ENABLE);

    // Claim the pins. IOInit's resource-owner records let the CLI `resource`
    // command surface pin conflicts against existing drivers.
    IO_t txIO = IOGetByTag(pDev->tx);
    IO_t rxIO = IOGetByTag(pDev->rx);

    IOInit(txIO, OWNER_CAN_TX, RESOURCE_INDEX(device));
    IOInit(rxIO, OWNER_CAN_RX, RESOURCE_INDEX(device));

    // TX is a push-pull alternate; RX needs a pull-up so the line idles
    // recessive when no transceiver is connected (prevents spurious dominant
    // readings during initialisation).
    IOConfigGPIOAF(txIO, IOCFG_AF_PP, pDev->txAF);
    IOConfigGPIOAF(rxIO, IOCFG_AF_PP_UP, pDev->rxAF);

    // Some boards route the transceiver's silent/standby input to a GPIO
    // (often pulled to silent in hardware); drive it low for normal
    // operation or the node bus-offs on its first transmission.
    if (pDev->silent) {
        IO_t silentIO = IOGetByTag(pDev->silent);
        IOInit(silentIO, OWNER_CAN_SILENT, RESOURCE_INDEX(device));
        IOConfigGPIO(silentIO, IOCFG_OUT_PP);
        IOLo(silentIO);
    }

    if (!canEnterConfigMode(regs)) {
        // Peripheral did not latch INIT; nothing more we can do safely.
        return;
    }

    // Classic CAN: clear the FD-enable and bit-rate-switch bits. Everything
    // else in CCCR can be left at reset (normal mode, no monitoring).
    regs->CCCR &= ~(FDCAN_CCCR_FDOE | FDCAN_CCCR_BRSE);

    // Nominal bit timing. Data bit timing (DBTP) is not needed for classic CAN.
    // If synthesis fails the caller-visible `initialized` flag stays false so
    // canTransmit() rejects traffic rather than running at an unknown rate.
    uint32_t nbtp;
    if (!canNominalBitTiming(bitrate, &nbtp)) {
        return;
    }
    regs->NBTP = nbtp;

    // Wipe the per-instance message RAM region to remove any prior contents.
    canClearMessageRam(device);

#if defined(STM32G4) || defined(STM32C5)
    // Accept-non-matching policy: route everything to Rx FIFO 0 (fields 00b
    // in ANFS / ANFE). The Message RAM layout itself is fixed by silicon.
    regs->RXGFC &= ~(FDCAN_RXGFC_ANFS | FDCAN_RXGFC_ANFE);
#elif defined(STM32H7)
    // H7 uses a separate GFC register and requires explicit Message RAM
    // configuration via SIDFC/XIDFC/RXF0C/TXBC/RXESC/TXESC.
    regs->GFC &= ~(FDCAN_GFC_ANFS | FDCAN_GFC_ANFE);
    canConfigureMessageRamH7(device, regs);
#endif

    // Reset the software TX ring so a re-init starts from a clean queue.
    pDev->txHead = 0;
    pDev->txTail = 0;
    pDev->txRingOverflows = 0;
    pDev->txCompletions = 0;
    pDev->txCompletionsSeen = 0;
    pDev->txStallSinceUs = micros();
    pDev->txStallRecoveries = 0;

    // Enable Rx FIFO 0 new-message and message-lost interrupts, the
    // transmission-complete interrupt, and arm the peripheral side of IRQ
    // line 0. The line-select register (ILS) resets to 0 which routes all
    // sources to line 0, so no write needed. Enabling RF0LE lets the IRQ
    // path observe and clear overrun flags so the peripheral does not stay
    // stuck in the "lost" state after a burst. TCE lets a freed Tx FIFO slot
    // re-trigger the ring drain (see canTxKick).
    regs->IE  |= FDCAN_IE_RF0NE | FDCAN_IE_RF0LE | FDCAN_IE_TCE;
    regs->ILE |= FDCAN_ILE_EINT0;

    // TXBTIE selects which Tx buffers raise the TC interrupt; set the low
    // CAN_TX_FIFO_DEPTH bits so every FIFO slot signals completion.
    regs->TXBTIE = (1UL << CAN_TX_FIFO_DEPTH) - 1UL;

