betaflight/betaflight/src/platform/common/stm32/can_hw.c
    canEnableInterrupt(device, pDev->irq0);

    if (!canExitConfigMode(regs)) {
        // Peripheral stuck in init — leave device flagged uninitialised so
        // canTransmit() and canInit()'s caller see the failure.
        return;
    }

    pDev->initialized = true;
}

bool canInit(canDevice_e device, uint32_t bitrate)
{
    if (device < 0 || device >= CANDEV_COUNT) {
        return false;
    }

    canInitDevice(device, bitrate);
    return canDevice[device].initialized;
}

void canRegisterRxCallback(canDevice_e device, canRxCallbackPtr callback)
{
    if (device < 0 || device >= CANDEV_COUNT) {
        return;
    }

    canDevice[device].rxCallback = callback;
}

// Move queued frames from the software TX ring into the hardware Tx FIFO
// until the ring is empty or the FIFO is full. When the FIFO fills we stop;
// the transmission-complete (TC) interrupt re-invokes this to resume the
// drain as slots free up.
//
// Concurrency: this is the sole consumer of txTail and the sole writer of the
// Tx FIFO. It runs either from task context (canTransmit, which masks irq0
// around the call) or from the TC ISR. Because the task path masks irq0 and
// the ISR path runs at the CAN NVIC priority, the two can never overlap, so
// the TXFQS read / slot write / TXBAR sequence stays atomic with respect to
// itself.
static void canTxKick(canDevice_e device)
{
    canDevice_t *pDev = &canDevice[device];
    FDCAN_GlobalTypeDef *regs = canRegs(device);

    while (pDev->txTail != pDev->txHead) {
        // Pair the producer-side fence on txHead so the compiler cannot hoist
        // the slot reads above the head snapshot above.
        __asm volatile ("" ::: "memory");

        uint32_t txfqs = regs->TXFQS;
        if (txfqs & FDCAN_TXFQS_TFQF) {
            // Hardware FIFO full; the TC interrupt will call us again once a
            // slot frees. Leave the frame queued at txTail. NOTE: resuming the
            // backlog relies on this function draining every free slot greedily
            // on each entry — a single latched TC per batch of completions is
            // then enough to flush the whole ring, so no wakeup is ever lost.
            break;
        }

        const canTxFrame_t *frame = &pDev->txRing[pDev->txTail];

        // Put index tells us which slot in the Tx FIFO the next message
        // belongs in. The peripheral manages the ring; software just fills
        // the slot and sets the corresponding TXBAR bit.
        uint32_t putIndex = (txfqs & FDCAN_TXFQS_TFQPI) >> 16;
        volatile uint32_t *slot = (volatile uint32_t *)canTxElementAddress(device, putIndex);

        // Word 0: identifier with XTD flag if extended.
        if (frame->isExtended) {
            slot[0] = CAN_TX_WORD0_XTD | (frame->id & 0x1FFFFFFFUL);
        } else {
            slot[0] = (frame->id & 0x7FFUL) << 18;
        }

        // Word 1: length only (no BRS/FDF -> classic CAN frame).
        slot[1] = (uint32_t)frame->length << CAN_TX_WORD1_DLC_POS;

        // Words 2..3: copy the payload in 32-bit chunks. The Tx RAM requires
        // 32-bit writes and classic CAN tops out at 8 bytes of payload, so
        // two words is always enough.
        uint32_t words[2] = { 0, 0 };
        for (uint8_t i = 0; i < frame->length; i++) {
            words[i >> 2] |= ((uint32_t)frame->data[i]) << ((i & 3U) * 8U);
        }
        slot[2] = words[0];
        slot[3] = words[1];

        // Trigger transmission of this slot, then release the ring entry.
        regs->TXBAR = 1UL << putIndex;
        pDev->txTail = (pDev->txTail + 1U) & CAN_TX_RING_MASK;
    }
}

// Queue a classic CAN frame for transmission. The frame is appended to the
// software TX ring and pushed into the hardware FIFO immediately if room is
// available; anything that doesn't fit is drained by the TC interrupt.
//
// Returns false only on invalid parameters, an uninitialised device, or a
// genuinely full software ring (true backpressure) — not on a transient
// hardware-FIFO-full, which the ring now absorbs.
//
// Must be called from task context only. The producer index (txHead) assumes
// a single producer; Betaflight's cooperative scheduler serialises task-level
// callers, and this function is never called from an ISR.
bool canTransmit(canDevice_e device, uint32_t identifier, bool isExtended,
                 const uint8_t *data, uint8_t length)
{
    if (device < 0 || device >= CANDEV_COUNT) {
        return false;
    }

    canDevice_t *pDev = &canDevice[device];
    if (!pDev->initialized || length > CAN_CLASSIC_MAX_DLC) {
        return false;
    }

    // Per API contract: data may be NULL only if length is zero. Reject
    // the invalid combination rather than dereferencing a null pointer.
    if (length > 0 && data == NULL) {
        return false;
    }

    const uint8_t head = pDev->txHead;
    const uint8_t next = (head + 1U) & CAN_TX_RING_MASK;
    if (next == pDev->txTail) {
        // Ring full — genuine backpressure. Drop and report so the caller can
        // retry; libcanard leaves the frame at its queue head on a false.
        //
        // A saturated ring with zero completions means nothing is ACKing
        // (peers unpowered, bus fault): auto-retransmission keeps the pending
        // hardware slots busy forever and TC never fires. The FDCAN has no
        // per-frame one-shot mode and disabling retransmission globally would
        // drop frames on ordinary arbitration loss, so recover by cancelling
        // the pending slots and discarding the stale backlog. A live bus
        // completes a classic frame in well under a millisecond, so this
        // never fires from congestion alone.
        const timeUs_t now = micros();
        if (pDev->txCompletions != pDev->txCompletionsSeen) {
            pDev->txCompletionsSeen = pDev->txCompletions;
            pDev->txStallSinceUs = now;
        } else if (cmpTimeUs(now, pDev->txStallSinceUs) >= CAN_TX_STALL_TIMEOUT_US) {
            FDCAN_GlobalTypeDef *regs = canRegs(device);
            NVIC_DisableIRQ((IRQn_Type)pDev->irq0);
            regs->TXBCR = (1UL << CAN_TX_FIFO_DEPTH) - 1UL;
            pDev->txTail = head;
            pDev->txStallRecoveries++;
            pDev->txStallSinceUs = now;
            NVIC_EnableIRQ((IRQn_Type)pDev->irq0);
        }
        pDev->txRingOverflows++;
        return false;
    }

