betaflight/betaflight/src/platform/common/stm32/can_hw.c
    canTxFrame_t *frame = &pDev->txRing[head];
    frame->id = identifier;
    frame->isExtended = isExtended;
    frame->length = length;
    for (uint8_t i = 0; i < length; i++) {
        frame->data[i] = data[i];
    }

    // Publish the filled slot before advancing head so the TC ISR (which
    // consumes via txTail) never observes an advanced head over a partially
    // written slot. Cortex-M is strongly ordered in hardware but the compiler
    // may reorder these non-volatile stores around the volatile head write.
    __asm volatile ("" ::: "memory");
    pDev->txHead = next;

    // Push as much as the hardware FIFO will take now. Mask this device's IRQ
    // so the TC handler (the other canTxKick caller) cannot run concurrently
    // and corrupt the FIFO put sequence. This also briefly masks RX on the same
    // line, but the critical section is only a few SRAM writes long. Safe to
    // unconditionally re-enable: irq0 is always enabled once initialized is set,
    // and canTransmit is task-context only (never called from an ISR).
    NVIC_DisableIRQ((IRQn_Type)pDev->irq0);
    canTxKick(device);
    NVIC_EnableIRQ((IRQn_Type)pDev->irq0);

    return true;
}

//-----------------------------------------------------------------------------
// ISR dispatch
//-----------------------------------------------------------------------------

static void canDispatchRx(canDevice_e device)
{
    canDevice_t *pDev = &canDevice[device];
    FDCAN_GlobalTypeDef *regs = canRegs(device);

    // Drain the FIFO. F0FL = fill level; looping until it hits zero guarantees
    // we handle multiple arrivals that may have accumulated before the ISR ran.
    while (regs->RXF0S & FDCAN_RXF0S_F0FL) {
        uint32_t getIndex = (regs->RXF0S & FDCAN_RXF0S_F0GI) >> 8;

        volatile const uint32_t *slot =
            (volatile const uint32_t *)canRxElementAddress(device, getIndex);

        uint32_t w0 = slot[0];
        uint32_t w1 = slot[1];

        bool isExtended = (w0 & CAN_RX_WORD0_XTD) != 0;
        uint32_t identifier = isExtended
            ? (w0 & CAN_RX_WORD0_EXTID_MASK)
            : ((w0 & CAN_RX_WORD0_STDID_MASK) >> CAN_RX_WORD0_STDID_POS);

        uint8_t dlc = (w1 & CAN_RX_WORD1_DLC_MASK) >> CAN_RX_WORD1_DLC_POS;
        if (dlc > CAN_CLASSIC_MAX_DLC) {
            dlc = CAN_CLASSIC_MAX_DLC;        // classic CAN safety clamp
        }

        uint8_t payload[CAN_CLASSIC_MAX_DLC];
        uint32_t w2 = slot[2];
        uint32_t w3 = slot[3];
        for (uint8_t i = 0; i < dlc; i++) {
            uint32_t word = (i < 4) ? w2 : w3;
            payload[i] = (uint8_t)(word >> ((i & 3U) * 8U));
        }

        // Ack the slot so the peripheral can recycle it for the next message.
        // Must be done before invoking the callback in case the callback is
        // slow; pending messages can still queue in other slots.
        regs->RXF0A = getIndex;

        if (pDev->rxCallback) {
            pDev->rxCallback(identifier, isExtended, payload, dlc);
        }
    }
}

void canIrqHandler(canDevice_e device)
{
    FDCAN_GlobalTypeDef *regs = canRegs(device);

    uint32_t ir = regs->IR;

    if (ir & FDCAN_IR_RF0N) {
        regs->IR = FDCAN_IR_RF0N;             // write-1-to-clear
        canDispatchRx(device);
    }

    // RF0L = Rx FIFO 0 message lost (overrun). Drop the flag so the
    // peripheral re-arms; dropped frames are visible in the device state
    // via an incrementing counter for diagnostics.
    if (ir & FDCAN_IR_RF0L) {
        regs->IR = FDCAN_IR_RF0L;
        canDevice[device].rxOverruns++;
    }

    // TC = transmission complete on a Tx FIFO slot. A slot has freed, so
    // resume draining the software TX ring into the hardware FIFO.
    if (ir & FDCAN_IR_TC) {
        regs->IR = FDCAN_IR_TC;
        canDevice[device].txCompletions++;
        canTxKick(device);
    }
}

// Strong definitions of the FDCAN IRQ handlers (weak stubs in startup *.s).
// These only exist when CAN is compiled in; otherwise the linker keeps the
// weak Default_Handler stubs. FDCAN3 is guarded with #ifdef so H7 variants
// without that instance (H74x/H75x) do not pick up an unresolved symbol.

void FDCAN1_IT0_IRQHandler(void)
{
    canIrqHandler(CANDEV_1);
}

void FDCAN2_IT0_IRQHandler(void)
{
    canIrqHandler(CANDEV_2);
}

#if defined(FDCAN3)
void FDCAN3_IT0_IRQHandler(void)
{
    canIrqHandler(CANDEV_3);
}
#endif

#endif // ENABLE_CAN
